{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": ".net",
    "1": "ajax",
    "2": "algorithm",
    "3": "android",
    "4": "angular",
    "5": "arrays",
    "6": "asp.net",
    "7": "asp.net-mvc",
    "8": "c",
    "9": "c#",
    "10": "c++",
    "11": "c++11",
    "12": "css",
    "13": "database",
    "14": "django",
    "15": "eclipse",
    "16": "html",
    "17": "ios",
    "18": "iphone",
    "19": "java",
    "20": "javascript",
    "21": "jquery",
    "22": "json",
    "23": "linux",
    "24": "macos",
    "25": "multithreading",
    "26": "mysql",
    "27": "node.js",
    "28": "objective-c",
    "29": "pandas",
    "30": "performance",
    "31": "php",
    "32": "postgresql",
    "33": "python",
    "34": "python-3.x",
    "35": "r",
    "36": "reactjs",
    "37": "ruby",
    "38": "ruby-on-rails",
    "39": "spring",
    "40": "sql",
    "41": "sql-server",
    "42": "string",
    "43": "swift",
    "44": "unit-testing",
    "45": "visual-studio",
    "46": "windows",
    "47": "wpf",
    "48": "xcode",
    "49": "xml"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_16": 16,
    "LABEL_17": 17,
    "LABEL_18": 18,
    "LABEL_19": 19,
    "LABEL_2": 2,
    "LABEL_20": 20,
    "LABEL_21": 21,
    "LABEL_22": 22,
    "LABEL_23": 23,
    "LABEL_24": 24,
    "LABEL_25": 25,
    "LABEL_26": 26,
    "LABEL_27": 27,
    "LABEL_28": 28,
    "LABEL_29": 29,
    "LABEL_3": 3,
    "LABEL_30": 30,
    "LABEL_31": 31,
    "LABEL_32": 32,
    "LABEL_33": 33,
    "LABEL_34": 34,
    "LABEL_35": 35,
    "LABEL_36": 36,
    "LABEL_37": 37,
    "LABEL_38": 38,
    "LABEL_39": 39,
    "LABEL_4": 4,
    "LABEL_40": 40,
    "LABEL_41": 41,
    "LABEL_42": 42,
    "LABEL_43": 43,
    "LABEL_44": 44,
    "LABEL_45": 45,
    "LABEL_46": 46,
    "LABEL_47": 47,
    "LABEL_48": 48,
    "LABEL_49": 49,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.33.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
